{"id":1445,"date":"2023-02-08T17:25:49","date_gmt":"2023-02-08T17:25:49","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=1445"},"modified":"2023-08-02T12:39:57","modified_gmt":"2023-08-02T12:39:57","slug":"imo-govt-pledges-co-work-space-for-startups","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/imo-govt-pledges-co-work-space-for-startups\/","title":{"rendered":"Imo govt. Pledges co-work space for startups"},"content":{"rendered":"\n<p>The Imo state government through its Honourable Commissioner for Digital Economy and E-Government, has promised to meet global best practices in the provision of services and enabling environment for startups in Imo. Speaking at an &lt;p&gt;Interactive Session among the government, young tech developers, online marketers, and several other industry leaders, the Honourable Commissioner, Dr. Chimezie Amadi assured participants that a Co-Work Space (Digital Hub) comprising facilities like desk space, power, and internet data, will be provided for startups in Owerri the state capital.  He explained that startups were actually experiments, and in this case, by young school leavers; who need the conducive work environment whether free or for a small fee to take away the many burdens orchestrated by individual private funding of such experiments. <\/p>\n\n\n\n<p>The interactive session which was hosted by the Imo State Ministry of Digital Economy and E-Government, attracted several government officials like Barr. Rex Anunobi, the Honourable Commissioner for Transport in the state; Special Advisers on Youth Affairs, Public Enlightenment, and Urban Water Supply; and startup ecosystem leaders like Messrs. Godwin Chike Ebere, Ikenna Okechukwu Hector and Chukwuma Anurunkem. It also had in attendance, 100 young tech developers, and monitors. It was held on the sidelines of the first ever Imo edition of the Cyberspace Awareness Month Campaign, in partnership with Cisco Networking Academy at the Imo Technology and Innovations Center. Beyond these however, and in my own view, I understand that a Free or For-A-Small-Fee Co-Work Space environment providing the above government assurances, will also afford the users of such facilities the smart opportunity to seamlessly interface and network with similar or other on-going experiments. A situation where a user, say a web developer, takes up a work space, and is in need of a graphics design; meanwhile there is also a graphics designer using the same I&#8217;ll hub; the web developer may approach the graphics designer for assistance to get his\/her task done. They get the point, work out terms and agree to collaborate or partner with each other. Points of understanding might include among several, a share in profits or credits, or returnable favors at the same or other time. However they decide, fact remains that there is an increased productivity among the startups who are mainly the youth, and who now find that they are never alone. The same analogy may also refer to a tech developer and a brand marketer; and other fields. Indeed, it was a pleasant surprise to participants and other guests at that forum, to find that already, a well equipped and functional tech and digital innovations hub and workspace had been in existence in the state for two years now. <\/p>\n\n\n\n<p>The hub\/workspace which is sited at the Imo Technology and Innovations Center (I.T.I.C) located at the former &#8216;ICAPS&#8217; premises at Egbu Road, Owerri, was venue for the interaction. ITIC is a public private initiative engineered by the state &#8216;digital&#8217; governor Hope Uzodinma&#8217;s administration in partnership with the Center for Innovation and Entrepreneurship (C.I.E). It is overseen by the Imo State Ministry of Digital Economy and E-Government (MDEE-G) with the very digital savvy Dr. Chimezie Paulinus Amadi as Commissioner. It is also worthy of note that the MDEE-G is a new creation of the state government, and the first-of-its-kind to be so created in the nation. It has already brought the entire startup community in Imo state on one page to reap from common benefits. One of such benefits is the partnership Training Program by the Ministry in conjunction with Cisco Networking Academy to be delivered for free to Imolites on Monday, October 17, 2022 at Bedrock Knowledge Center, #14, M.C.C. Road, Owerri by 10am. <\/p>\n\n\n\n<p>According to a speech presented by Dr. Chimezie Amadi&#8217;s at the earlier cybersecurity awareness session, beneficiaries in Imo State will be provided with free online cybersecurity training to educate them to spot hacking attempts and illegitimate emails and avoid potential incidents. At the end of the training, learners who actively participate to pass the Introduction to Cybersecurity Course and Cyber Essentials will be rewarded with a Cisco Digital Badge as well as a Certificate of Completion of training. The Commissioner explained: &#8220;A Cisco Digital Badge is an emblem distinguishing an achievement that can be shared and validated digitally on Linked In, Twitter, Facebook, Xing, via Email, shared link, embed code into web page or blog&#8221;.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Imo state government through its Honourable Commissioner for Digital Economy and E-Government, has promised to meet global best practices in the provision of services and enabling environment for startups in Imo. Speaking at an &lt;p&gt;Interactive Session among the government, young tech developers, online marketers, and several other industry leaders, the Honourable Commissioner, Dr. Chimezie &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/imo-govt-pledges-co-work-space-for-startups\/\"> <span class=\"screen-reader-text\">Imo govt. Pledges co-work space for startups<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":3791,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[1],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/07\/WhatsApp-Image-2023-07-31-at-19.40.23.jpeg?fit=1600%2C1066&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/1445"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=1445"}],"version-history":[{"count":0,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/1445\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/3791"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=1445"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=1445"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=1445"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}