{"id":3451,"date":"2023-05-19T16:00:00","date_gmt":"2023-05-19T16:00:00","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=3451"},"modified":"2023-08-04T13:46:54","modified_gmt":"2023-08-04T13:46:54","slug":"didon-integrated-agency-awards-dr-chimezie-amadi-the-best-commissioner-in-imo-state","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/didon-integrated-agency-awards-dr-chimezie-amadi-the-best-commissioner-in-imo-state\/","title":{"rendered":"Didon Integrated Agency Awards Dr. Chimezie Amadi, the Best Commissioner In Imo State"},"content":{"rendered":"\n<p>Comrade Odoemene Onyedikachi Placid CEO of DIDON INTEGRATED AGENCY led his team on a courtesy call on Dr. Chimezie Amadi, Honourable Commissioner for Imo State Ministry of Digital Economy and E-Government Owerri today being Friday May 19th 2023.<\/p>\n\n\n\n<p>Dr. Chimezie Amadi was honoured with a Corporate Plaque of the Agency in recognition of his Outstanding Leadership and Efficient Services to the Government of Imo State through a World-class Management of the ongoing Skillup Imo Project by the Prosperity regime of our amiable Governor Distinguished Sen. Hope Uzodimma.<\/p>\n\n\n\n<p>Based on it he was honoured as the &#8220;<em><strong>Most Outstanding Honourable Commissioner in Imo State 2022<\/strong><\/em>&#8221; by a professional assessment and attestation from DIDON INTEGRATED AGENCY verifiably on the footprints of the Skillup Imo Project which is the most accessible and efficiently executed project of the APC Goverment on record.<\/p>\n\n\n\n<p>The people&#8217;s Honourable Commissioner Dr. Chimezie Amadi is on a mission to assist this government achieve all the gains of the Skillup Imo Project targeted at providing a world-class Digital Skill acquisition for 100,000 Imo Youths to make the self reliant and job creators as emerging technological entrepreneurs.<\/p>\n\n\n\n<p>The Vision of the Skillup Imo Project is to create massive job creators from the beneficiaries of the Skillup Imo Project which has successfully graduated Cohort 1 and now have Cohort 2 beneficiaries on training at various Skillup Imo Project Acquisition Centres under this laudable initiative of Distinguished Sen. Hope Uzodimma the Digital Governor of our time.<\/p>\n\n\n\n<p>After an intensive Course beneficiaries are empowered with Digital kits and gadgets like Laptops, all kinds of Equipment useful to start their various Digital businesses from the Skills acquired in the course of the training.<\/p>\n\n\n\n<p>A Flag off exercise, Graduation ceremony and distribution of Digital kits and gadgets are evidences of world-class standards and reputation which the Governor of the State has achieved.<\/p>\n\n\n\n<p>Imo State Government places priority to the full accomplishments of the Skillup Imo Project designed to efficiently empower 100,000 Imo Youths from all the 27 LGAs in participation.<\/p>\n\n\n\n<p>Didon Integrated Agency urges all Imo youths who are disposed to avail themselves this rare opportunity by acquiring these recognised and viable Digital Skills sponsored by the Imo State Government under the Prosperity regime of our amiable Governor, Distinguished Sen. Hope Uzodimma.<\/p>\n\n\n\n<p>Gov. Hope Uzodimma has indeed written his name on gold through the Skillup Imo Project and Imo youths and residents are taken the scheme seriously in acquiring the Digital Skills offered at various Centres accessible to their towns and location of residence.<\/p>\n\n\n\n<p>Imo State has taken the lead in Digital Economy and E-Government promotion in Nigeria through the transparent Empowerment of her citizens of all categories with the man overseeing the Ministry, Dr. Chimezie Amadi, who is workaholic and honest in the implementation strategies as a knowledgeable Digital Skills promoter in Nigeria from many years of experience in the industry.<\/p>\n\n\n\n<p>The Digital Hub of Imo State has been fully energised by the Skillup Imo Project to impact on the lives of the Imo Youths as the most viable Empowerment Scheme which has been implemented successfully and beneficiaries are drawn through transparent processes under the supervision of Dr. Chimezie Amadi, Honourable Commissioner, which is the first of its kind in the history of Imo State.<\/p>\n\n\n\n<p>God bless Imo State.<\/p>\n\n\n\n<p>Warmest Regards,<br>Odoemene Onyedikachi Placid<br>CEO Didon Integrated Agency<br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Comrade Odoemene Onyedikachi Placid CEO of DIDON INTEGRATED AGENCY led his team on a courtesy call on Dr. Chimezie Amadi, Honourable Commissioner for Imo State Ministry of Digital Economy and E-Government Owerri today being Friday May 19th 2023. Dr. Chimezie Amadi was honoured with a Corporate Plaque of the Agency in recognition of his Outstanding &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/didon-integrated-agency-awards-dr-chimezie-amadi-the-best-commissioner-in-imo-state\/\"> <span class=\"screen-reader-text\">Didon Integrated Agency Awards Dr. Chimezie Amadi, the Best Commissioner In Imo State<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":3959,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[44],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/05\/Didon-Integrated-Agency-meets-with-Dr.-Chimezie-Amadi-Currently-the-Honourable-Commissioner-Imo-State-Ministry-of-Digital-Economy-and-E-Government.jpg?fit=540%2C1080&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3451"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=3451"}],"version-history":[{"count":0,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3451\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/3959"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=3451"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=3451"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=3451"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}