{"id":3603,"date":"2023-07-27T00:03:45","date_gmt":"2023-07-27T00:03:45","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=3603"},"modified":"2023-08-02T12:35:43","modified_gmt":"2023-08-02T12:35:43","slug":"imo-deputy-speaker-lends-support-to-the-uzodinmas-digital-initiative-2","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/imo-deputy-speaker-lends-support-to-the-uzodinmas-digital-initiative-2\/","title":{"rendered":"IMO DEPUTY SPEAKER LENDS SUPPORT TO THE UZODINMA&#8217;S DIGITAL INITIATIVE."},"content":{"rendered":"\n<p>The winners of the season 2 SkillUpImo Challenge, a sub-initiative of Hope Uzodinma&#8217;s led digital transformation agenda have emerged. You may recall that in each Cohort of the SkillupImo program, the Ministry organizes a hackathon to stimulate the innovative and creative prowess of the Learners. The hackathon is one of the strategic initiatives embedded in the IMO Digital Economy Agenda ( IDEA) 2022-2026, which gives a big fillip to the goal of equipping 300,000 Imolites with industry 4.0 skill sets by 2026.<\/p>\n\n\n\n<p>The weekly challenge winners were unveiled in an elaborate ceremony held at the Ministry of Digital Economy and E-Government. They went home with cash prizes and opportunities for employment in wakanow.com [a leading travel technology company in Africa], which was present at the Prize giving ceremony for the SkillupImo Cohort 2 season 2 Challenge. The Wakanow Team, led by Mr. Gbenga Onitilo, expressed the tech companies&#8217; excitement at the efforts of the Imo State government to empower its youths with cutting-edge digital skills. In his words, &#8220;Wakanow&#8217;s success can be ascribed to its heavy investment in digital technology&#8221;. Mr. Gbenga announced the formal opening of the wakanow.com office in Owerri while extending an invitation to SkillupImo trainees.<\/p>\n\n\n\n<p>Revealing her youth empowerment project, termed Affiliate program, that offers the opportunity to become entrepreneurs in the travel business, he advised all the trainees to sign up for the lucrative offer. Commissioner for Digital Economy and E-Government, Dr.Chimezie Amadi, expressed happiness with the development. “unlike before Hope Uzodimma&#8217;s administration, tech companies are beginning to have footprints in Imo, all thanks to the visionary and forward-thinking Digital Governor of Nigeria Dist. Senator Hope Uzodinma CON for creating the enabling environment for tech-driven businesses to thrive in IMO state”.<\/p>\n\n\n\n<p>The event&#8217;s highlight, which elicited exultant joy and applause from the trainees, was Dr. Amadi&#8217;s announcement that N1milliin would be up for grabs by the top 10 winners in the season 3 challenge. The Honorable Commissioner confirmed that Rt.Hon.Chyna Amara Iwuanyanwu, the Deputy Speaker of the Imo House of Assembly, has committed to lend support to the Governor&#8217;s SkillupImo Cohort 2, Season 3 challenge. Rt. Hon. Chyna Amara Iwuanyanwu, a firm lover of the youths and a great supporter of the digital initiative of His Excellency, who continually seeks to promote youth-centered development, donated a cash prize of N400,000 to the first 4 lucky winners of the Hope Uzodinma&#8217;s SkillupImo Challenge.<\/p>\n\n\n\n<p>The award ceremony drew to a close by handing prizes to the winners. A differently-abled &#8211; trainee, Tenderly Nwakji, studying Leadership and Entrepreneurship at the Ministry Centre, won the 4th Prize. Her category was judged based on video quality, creativity, and presentation. 3rd prize winner, Dandy Ifeanyi Alvan studying video editing at the Alvan Centre, won with 246 likes, 246 comments, and 22 shares, being the second runner-up with the highest number of likes, comments, and shares. The previous winner of the last Cohort 2 challenge, Anyanwuocha Chidi Martins, an Intro to Programming student of Poly Nekede, again mesmerized hundreds of other competitors to come out tops to grab the 2nd price award.<\/p>\n\n\n\n<p>Damian Chidera David, a student of Imo State University studying Front-end development, awed the world with the best video quality, creativity, and presentation skills to clench the first in the SkillupImo Cohort 2 Season 2 challenge. In his vote of thanks, first-prize winner Damian Chidera David applauded the sponsors of the season 3 challenge, Rt. Hon Chyna Amara Iwuanyanwu and the Executive Governor of Imo State, Dist. Senator Hope Uzodinma for their Love for the Digital empowerment of the State and, at the same time, called on Imo youths to utilize this invaluable opportunity to acquire digital economic empowerment.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The winners of the season 2 SkillUpImo Challenge, a sub-initiative of Hope Uzodinma&#8217;s led digital transformation agenda have emerged. You may recall that in each Cohort of the SkillupImo program, the Ministry organizes a hackathon to stimulate the innovative and creative prowess of the Learners. The hackathon is one of the strategic initiatives embedded in &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/imo-deputy-speaker-lends-support-to-the-uzodinmas-digital-initiative-2\/\"> <span class=\"screen-reader-text\">IMO DEPUTY SPEAKER LENDS SUPPORT TO THE UZODINMA&#8217;S DIGITAL INITIATIVE.<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":3819,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[52],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/07\/Deputy-Speaker-Rt-Hon-Amara-Iwuanyanwu.webp?fit=420%2C420&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3603"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=3603"}],"version-history":[{"count":0,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3603\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/3819"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=3603"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=3603"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=3603"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}