{"id":3831,"date":"2023-01-11T21:33:00","date_gmt":"2023-01-11T21:33:00","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=3831"},"modified":"2023-08-03T16:01:06","modified_gmt":"2023-08-03T16:01:06","slug":"ministry-floats-skillupimo-challenge","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/ministry-floats-skillupimo-challenge\/","title":{"rendered":"Ministry floats Skillupimo challenge "},"content":{"rendered":"\n<p><\/p>\n\n\n\n<p>The Imo State government has introduced a weekly youth competition to ignite and unlock students&#8217; digital literacy ingenuity and innovation. The competition tagged: &#8216;SkillUplmoChallenge&#8217;, is a sub-initiative of SkillUpImo Project, a broader and premier human capacity development programme launched by the state government in December 2022. The SkillUplmoChallenge will help fire up digital innovation and ideas amongst students in the state with cash prizes handed to a winner each week.<\/p>\n\n\n\n<p>The &#8216;SkillUplmoChallenge is expected to drive the overall objective of the SkillUpImo Project, focused on empowering citizens of Imo State with cutting-edge digital skills that will keep them relevant in the 21st century. The maiden edition of the SkillUplmoChallenge was held at the Ministry&#8217;s headquarters at No 28 Egbu Road Owerri. At the maiden edition, a student of the Federal University of Technology, Owerri (FUTO) Centre, Chucks Official was adjudged winner in digital skill innovation, in the first week, based on shared experiences, ingenuity and digital innovation exhibited.<\/p>\n\n\n\n<p>While presenting the cash prize to the winner the Hon. Commissioner, Ministry of Digital Economy and E-Government in Imo State, Dr. Chimezie Amadi said that the Challenge will accelerate the actualization of the broader objectives of the SkillUpImo project. The Commissioner, in his address, noted that the broader objectives, are to train 300,000 Imolites over the next three years, with 100,000 trained each year; connect 60% of the graduands to high-paying jobs as well as empower 40% of the graduands to be their own bosses, becoming tech entrepreneurs and launching their own companies, among others.<\/p>\n\n\n\n<p>He added that the SkillUpImo Challenge was created to sustain the interest of the youth and boost excitement in the digital skill acquisition programme. Dr Amadi disclosed that through the SkillUpImo Challenge, a student stands the chance of winning cash prizes or other awards each week for demonstrating great commitment to learning and putting in good efforts to show the workings of skills learned.<\/p>\n\n\n\n<p>The commissioner stated that the first batch of 5,000 students from the 100,000 that will be trained this year, will be graduating by the end of January 2003, to immediately bring on board the next batch of beneficiaries of the digital skills acquisition programme for training. While commending the students on their seriousness and diligence exhibited so far, the Commissioner encouraged the youths to do more and be more proactive, In his words; &#8220;Be more of a doing person than a talking person, theSkillUplmo Project is all about creating content that can be marketed using digital tools that the public can embrace, consume and pay for&#8221;.<\/p>\n\n\n\n<p>Dr Amadi assured that with the implementation of the project, the Senator Hope Uzodimma-led administration would soon realise its vision of making the State, the digital skills hub of Africa. Receiving the cash prize on behalf of the winner, Mr Excel thanked the commissioner for the government&#8217;s ingenuity and interest in seeing to the empowerment of Imolites with forefront digital skills that will keep them relevant and endorse them as the preferred, world over. The SkillUplmo project combines hard technical skills with soft employability skills.<\/p>\n\n\n\n<p>Skilluplmo project is aimed at grooming well-rounded professionals who can ply their trade at any level in the local and global digital economy. It covers entry and advanced-level digital skills such as computer appreciation, device repairs and maintenance, content creation, web design and development, Internet of Things (IoT), Machine Learning (ML), Artificial Intelligence (Al), Big Data Analytics, Cybersecurity, et cetera.<br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Imo State government has introduced a weekly youth competition to ignite and unlock students&#8217; digital literacy ingenuity and innovation. The competition tagged: &#8216;SkillUplmoChallenge&#8217;, is a sub-initiative of SkillUpImo Project, a broader and premier human capacity development programme launched by the state government in December 2022. The SkillUplmoChallenge will help fire up digital innovation and &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/ministry-floats-skillupimo-challenge\/\"> <span class=\"screen-reader-text\">Ministry floats Skillupimo challenge <\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":2852,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[31],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/06\/DSC_1495-scaled.jpg?fit=2560%2C1707&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3831"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=3831"}],"version-history":[{"count":0,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3831\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/2852"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=3831"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=3831"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=3831"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}