{"id":3836,"date":"2023-07-07T12:10:00","date_gmt":"2023-07-07T12:10:00","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=3836"},"modified":"2023-08-16T09:48:39","modified_gmt":"2023-08-16T09:48:39","slug":"uzodinmas-focused-leadership-and-lmo-digital-transformation","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/uzodinmas-focused-leadership-and-lmo-digital-transformation\/","title":{"rendered":"Uzodinma&#8217;s Focused Leadership And lmo Digital Transformation"},"content":{"rendered":"\n<p><\/p>\n\n\n\n<p>By Chimezie Amadi.<\/p>\n\n\n\n<p>Imo State Governor, Hope Uzodimma,took the reins of government in the Eastern Heartland when I was still with the Nigerian Communications Commission (NCC) over three years ago When I first met him over a decade ago, his charming personality and rare leadership qualities endeared me to him.<\/p>\n\n\n\n<p>Uzodimma is a man with hallowed grace and a Midas touch. His most striking quality is his uncommon ability to think globally while acting locally, with exceptional street intelligence.<\/p>\n\n\n\n<p>Before he invited me to serve in his government, I had had the opportunity of working with him quietly at the background at strategic and operational levels.<\/p>\n\n\n\n<p>On his election as governor, in one of our discussions when he mooted the idea of running a tech-driven government and growing the Imo digital economy to diversify internal revenue generation drive, enhance job opportunities and tech diffusion in all sectors of the state&#8217;s economy. I immediately concluded that Imo is in a new deal and has gotten it right this time.<br>This is because it takes a forward-looking leader and a revolutionary thinker to see the enormous benefits of a digital economy.<\/p>\n\n\n\n<p>Now, working close to him full time. I see a visionary and purposeful leader, generational thinker, game-changer, kind-hearted and good listener.<\/p>\n\n\n\n<p>I also discovered that he was highly underrated by people not close to him.<br>When I took office. he demanded a policy thrust to encapsulate his digital agenda for the state and that gave rise to the development of the Imo Digital Economy Agenda (IDEA) 2022-2026.<br>Uzodimma&#8217;s five-year agenda to digitize the state will stimulate digital revolution, trigger investments in smart infrastructure and birth a viral smart economy and a connected city state.<\/p>\n\n\n\n<p>The Imo Digital Economy Agenda (IDEA) 2022-2026 is anchored on six strategic pillars:<br>Digital Literacy and Skill, Solid Infrastructure, Service Infrastructure, Advocacy, Monitoring and Evaluation, Collaboration and Partnership.<\/p>\n\n\n\n<p>It involves connecting the over 600 autonomous communities in the 27 local councils of the state to the Internet. The policy was conceptualized to harness the Information and Communication technology (ICT) potential, driving new solutions to developmental challenges, which would engender growth, essentially to foster competitiveness, enhance access to information and knowledge, as well as eradicate poverty and ensure social inclusion.<\/p>\n\n\n\n<p>Having boasted that he is not in Imo to joke, the governor has taken up various ambitious projects, including roads infrastructure and healthcare.<\/p>\n\n\n\n<p>The Owerri\/Okigwe road, Owerri\/Orlu road which have been completed, while Owerri\/Mbaise road which is nearing completion, are visible testaments to his focused leadership.<br>In his acceptance speech after his inauguration in 2020, the governor had promised, among others, to take Health For All (HEFA)to the 27 local councils, to strengthen existing primary healthcare workforce in the state, as well as rehabilitation, renovate and equip all dilapidated community <a href=\"http:\/\/Greenbytes.com.ng\" target=\"_blank\" rel=\"noopener\">health<\/a> centres in the state. These have proved not to be empty promises, as civil servants in the state now enjoy free medical services.<\/p>\n\n\n\n<p>There is limited space to enumerate Uzodimma&#8217;s transformation agenda in Imo. But one that generations yet unborn will live to remember is the SkillUplmo Project.<\/p>\n\n\n\n<p>SkillUplmo is fashioned to position Imo state as the digital Hub of Africa, to birth a big Startup economy and connects Imo tech talents to the global gig economy. It has remained the biggest human capital developmental effort embarked upon by any state Government in modern times.<\/p>\n\n\n\n<p>In the Skilluplmo programme Cohort 1, Uzodimma trained and equipped 5,000 Imo youths with Industry 4.0 tech skills and startup kits to enable them ply trade anywhere in the world while another set of 15,000 Youths are currently being trained in basic, intermediate and advanced digital skills in the ongoing SkillupImo programme cohort 2.<\/p>\n\n\n\n<p>Prof.Mohammed Ajiya, the President\/Chief Executive Officer of Digital Bridge Institute (DBI), Abuja, an international centre for Information and Communications Technology (ICT) studies, captured the initiative in the following words: &#8220;The beauty of the digital economy is that you could be working for a company in America, Asia or Europe from the comfort of your home<br>SkillUpImo is one of those initiatives that target youths to prepare them for the digital economy space, which has contributed over 18 percent to the the country&#8217;s Gross Domestic Product (GDP).”<\/p>\n\n\n\n<p>Many tech giants are already buying into the project,while academies and examination bodies are offering certifications.<\/p>\n\n\n\n<p>Small wonder the training centres have become beehives of activities, even on public holidays.Many youths from the South South and SouthWest geopolitical zones, as well as other states troop to the centres to enrol.<\/p>\n\n\n\n<p>The youths, mostly graduates of other fields, are being trained on basic digital skills like computer appreciation, phone repair,Closed Circuit Television (CCTV) installation, and car tracking.<\/p>\n\n\n\n<p>On intermediate digital skills, the youths are trained in digital marketing, graphics, video, photo editing and digital entrepreneurship. They are also trained in advanced digital skills such as cybersecurity, UI\/UX, mobile app development, front-end and back-end development, blockchain technology, data analysis and project management.<\/p>\n\n\n\n<p>The initiative is part of the move to align Imo with the Federal Government&#8217;s objective of diversifying the economy as encapsulated in the National Digital Economy Policy&#8217;and Strategy(NDEPS)2020-2030.<br>Interestingly, other &#8216;bigger&#8217; states are copying the initiative, and Imo is happy to be the pioneer in the country.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>By Chimezie Amadi. Imo State Governor, Hope Uzodimma,took the reins of government in the Eastern Heartland when I was still with the Nigerian Communications Commission (NCC) over three years ago When I first met him over a decade ago, his charming personality and rare leadership qualities endeared me to him. Uzodimma is a man with &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/uzodinmas-focused-leadership-and-lmo-digital-transformation\/\"> <span class=\"screen-reader-text\">Uzodinma&#8217;s Focused Leadership And lmo Digital Transformation<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":3844,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[55],"tags":[51],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/07\/site-scaled.jpg?fit=2560%2C1181&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3836"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=3836"}],"version-history":[{"count":0,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3836\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/3844"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=3836"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=3836"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=3836"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}