{"id":3924,"date":"2023-08-03T18:03:48","date_gmt":"2023-08-03T18:03:48","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=3924"},"modified":"2023-08-16T09:30:21","modified_gmt":"2023-08-16T09:30:21","slug":"skillupimo-imo-states-ambitious-venture-into-silicon-valley","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/skillupimo-imo-states-ambitious-venture-into-silicon-valley\/","title":{"rendered":"SkillupImo: Imo State&#8217;s ambitious venture into silicon valley"},"content":{"rendered":"\n<p>&#8220;The beauty of the digital economy is “that you could be working for a company in America, Asia or Europe from the comfort of your home. Skilluplmo is one of those initiatives that target youths to prepare them for the digital economy space, which has contributed to over 18 percent of the country&#8217;s Gross Domestic Product(GDP)&#8221;. The above is how Prof. Mohammed Ajiya, the President\/Chief Executive Officer of Digital Bridge Institute (DBI), Abuja, an international centre for Information and Communications Technology(ICT) studies, described what is presently cooking in Imo, in a chat with The Guardian.<\/p>\n\n\n\n<p>DBI is the training arm of the Nigerian Communications Commission (NCC). India, today, exports tech talents to many advanced countries, including the United States (U.S.). The Asian country did not just happen in the silicon valley; it took some ambitious effort. Imo is treading that path that India trod years back.The vehicle is Skilluplmo, the governor&#8217;s initiativethrough the Ministry of<br>Digital Economy and E-Government Government he created last year. A chat with the<br>commissioner in charge of the ministry, Dr.Chimezie Amadi, revealed a tall ambition, which seems<br>unrealistic in this<br>environment. But a little research across the state and beyond pans the search light to the prospects of this initiative, as techpreneurs and experts affirm its<br>potential to take the state into the silicon valley by nurturing tech talents the state can export to Japan, U.S.and other countries of the world.<\/p>\n\n\n\n<p>Already, Imo citizens at home and in the diaspora have started buying into the project.Cash and high-end computers have been<br>donated, and employment opportunities promised.Those that have bought into the initiative include the Chairman of Zinox<br>Group,Leo Stan Ekeh, and Chairman of Turkey based Inno &amp; Bisco Oil and Gas Limited,Innocent Unoha.<br>Astute businessmen like Ekeh dread volatile<br>environments. Though Imo plays in the league of states plagued by insecurity, the Zinox boss still bought into the project.<br>On why he took such a risk, Ekeh told The Guardian that Imo needs employment and that the<br>project would make lmo<br>youths, even graduates,<br>employable.<\/p>\n\n\n\n<p>“I will aways support in anyway i can, any initiative that will make lmo great, no matter the government in power,&#8221; he added.<\/p>\n\n\n\n<p>The fever of this project seems to be catching almost every segment of the Eastern Heartland and beyond, even the academia. The Director, University Computer Centre, Federal University of<br>Technology, Owerri(FUTO), Prof.Damian Dike, described it as a rich and interesting project.<br>&#8220;Skilluplmo is a very rich and interesting programme that has great potential of technologically<br>revolutionalising our state.It will build up self-employable skills of our youths to reduce their involvement in juvenile crimes and make the state the technology hub of Nigeria, if well-funded as contained in the original plan. “It is in view of the afore mentioned noble goals that the innovative Vice Chancellor of FUTO,Prof. (Mrs.)Nnenna Oti, approved the partnership of FUTO with Imo government in this programme, so that over 800 FUTO students and indigenes of our host communities can join without much distance- associated costs,&#8221; he told The Guardian.<\/p>\n\n\n\n<p>Chidi Duru, an Owerri-based techpreneur,said the programme, underwhich 5,000 lmo youths areundergoing training, has been very impactful.<br>The youths, according to him, are being trained on basic digital skills like computer appreciation, phone repair, Closed Circuit Television (CCTV)installation and car<br>tracking.<br>On intermediate digital<br>skills, the youths are trained in digital marketing, graphics, video and photoediting. They are also trained in advanced digital skills such as cybersecurity, UI\/UX, mobile app development, front-end development, back-end development, blockchain technology, data analysis and project<br>management. The commissloner, who was an assistant Director at NCC, said the initiative is part of the move to align Imo with the Federal Government&#8217;s objective of diversifying the economy as encapsulated in the National Digital Economy Policy and Strat-<br>egy (NDEPS) 2020-2030.<\/p>\n\n\n\n<p>He added:&#8221;Realising that digital technology drives innovation and creates job opportunities, leading to economic prosperity, there is need to create a Ministry that will focus on the development of lmo digital economy and create policies and programmes that will position the state<br>as a key player in the expanding global digital economy valued at $11.5trillion, which have<br>witnessed two-fold growth in 15 years and projected to account for a quarter of the global economy in the next 10years , according to the 2016 Report by Oxford Economy.<\/p>\n\n\n\n<p>&#8220;Imo government also realised the need to<br>harness ICT potential to provide new solutions to developmental challenges, foster economic growth ,access information and knowledge, eradicate poverty and socialinclusion in the state.&#8221;<br>Commending the lmo Governor for creating the first Ministry of Digital Economy in any Nigerian State, Prof.Ajiya hopes that other states will copy Imo and harness the potential in the digital economy space.<br>According to him,the Digital Economy<br>contributes more than crude oil to the GDP, as it creates unicorns.<br>His words:&#8221;So,the future is Digital Economy. This is where the world is going.<br>In Nigeria ,we should not be left behind.<br>“You may have known unicorns, those companies valued at over S1 billion without being listed on the stock market. We have about eight in Africa and five or six of them are from Nigeria.So, Uzodimma is<br>targeting Imo youths to become future billionaires.This means the future is being brought closer in Imo.&#8221;<br>For him, Skilluplmo is an excellent initiative, which will see lmo indigenes.becoming masters of the fourth industrial<br>revolution.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The beauty of the digital economy is “that you could be working for a company in America, Asia or Europe from the comfort of your home. Skilluplmo is one of those initiatives that target youths to prepare them for the digital economy space, which has contributed to over 18 percent of the country&#8217;s Gross Domestic &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/skillupimo-imo-states-ambitious-venture-into-silicon-valley\/\"> <span class=\"screen-reader-text\">SkillupImo: Imo State&#8217;s ambitious venture into silicon valley<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":45,"featured_media":3882,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[31],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/08\/DSC_1544-scaled.jpg?fit=2560%2C1707&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3924"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/45"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=3924"}],"version-history":[{"count":0,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3924\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/3882"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=3924"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=3924"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=3924"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}