{"id":3985,"date":"2023-01-12T07:28:31","date_gmt":"2023-01-12T07:28:31","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=3985"},"modified":"2023-08-08T14:47:46","modified_gmt":"2023-08-08T14:47:46","slug":"soon-imo-will-be-africas-digital-hub-dr-chimezie-amadi","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/soon-imo-will-be-africas-digital-hub-dr-chimezie-amadi\/","title":{"rendered":"Soon, Imo will be Africa&#8217;s Digital Hub &#8211; Dr Chimezie Amadi"},"content":{"rendered":"\n<p>Pioneer Commissioner for Digital Economy and e-Government, Dr. Chimezie Amadi revealed in this interview with National News blast that Imo State will soon become Africa&#8217;s digital hub thanks to plans being activated by the newly created ministry, the first in Nigeria Excerpts.<\/p>\n\n\n\n<p>Q: May we know you, Sir?<\/p>\n\n\n\n<p>A: I am Dr. Chimezie Amadi, the Imo State Commissioner for Digital Economy and e-Government.<br>Q: Can you shed some light on where we are right now?<\/p>\n\n\n\n<p>A:Yes. Here,we have a learning Centre embedded in the Ministry of Digital Economy and e-Government head office located on Egbu Road,Owerri.<\/p>\n\n\n\n<p>Q: What exactly, do you do here?<\/p>\n\n\n\n<p>A: First of all, it is important to note that this Ministry is the first of its kind in Nigeria. It was created by the Governor of Imo State, His Excellency, Distinguished Senator Hope Uzodimma to promote digital economy to place Imo as the leading digital economy state in Nigeria. So, in the Ministry, we have developed a plan called IDEA 2022-2026. It stands for Imo Digital Economy Agenda 20222-2026. It is a five-year plan with critical pillars designed to ensure of a robust digital economy in Imo State.<\/p>\n\n\n\n<p>The first pillar is Digital Literacy and Skills. The second pillar is the Solid Infrastructure Pillar. The third is Soft Infrastructure Pillar. The fourth is Advocacy Pillar. The fifth is the Partnership and Collaboration<br>Pillar.&nbsp;These pillars, when developed, the digital economy of Imo State will be standing on them.&nbsp;<\/p>\n\n\n\n<p>Q: What is digital economy?&nbsp;<\/p>\n\n\n\n<p>A: Digital economy is what we call the internet economy or the web-based economy. Globally today, the world is transitioning from analogue economy or traditional economy to digital economy. What this means is that government activities and services will leverage digital economy to provide quality and efficient services through the people and you will see most activities of government like land administration, healthcare delivery, and education upgraded via the deployment of digital technology beyond what we are experiencing today.<\/p>\n\n\n\n<p>It is easier for people to access land administration services. We are going to digitize that sector. In the transportation sector, we shall develop an e-transport system that will help people access transportation services. You don&#8217;t need to go to the motor park to buy tickets to travel from Owerri to Abuja.<\/p>\n\n\n\n<p>Q: Do you have facilities to sustain this project?<\/p>\n\n\n\n<p>A: Of course. That is why I talked about the solid infrastructure. The first infrastructure is literacy and skills as the first pillar. But when you talk about the solid infrastructure, it focuses on building robust network and access infrastructure to support our digital transformation goal. That requires a fibre-optic networks, tools like computers, laptops, accessible, and affordable internet being provided so that the civil service will make sure that the system there is computerised and the processes are digitised, development of application soft wares to support the services and training of the work force in the civil service to become digital compliant. That will help them to use those infrastructures provided for them.<\/p>\n\n\n\n<p>Critical to your question is the development of broadband infrastructure in Imo State. Globally, the broadband infrastructure is in very scarce supply. It is not just in Africa but the whole world. Everybody in running # raee io increase his broadband stock. So, what we have as plan which we call solid infrastructure pillar is to ensure that that there is alibre network that is developed to connect all the critical areas and critical sectors in Imo State, When that is done, you have laid a solid foundation for digital transformation in Imo State.<\/p>\n\n\n\n<p>Q: How long does the training last?<\/p>\n\n\n\n<p>A: This training is a three-year program. The objective is to make lmo the digital skills hub of Africa. In the next three years, Imo State is planning to train three hundred thousand youths and equip them with what we call fourth industrial revolution skill sets. For the trainees you have seen, there are three categories of programs. You have the basic for beginners which lasts for a maximum of five weeks. We have the intermediate program which lasts for a maximum of eight months. Then we have the advanced program which lasts for three months.<\/p>\n\n\n\n<p>Q:So,the trainees cannot gain appreciable knowledge till they have spent three years here?<\/p>\n\n\n\n<p>A:When you say how long does this program last, for the entire program, it is three years. Most of them are at the basic level. Their program will end by the last weck of January. We will graduate those who have learnt and passed the tests we are going to set for them. So, precisely to your question, if it is a graduate trainee, what you have now will last for a maximum of four to six months. Someone who is doing cyber security or robotics, identification and simulation will spend more time.<\/p>\n\n\n\n<p>Q:How many of such centres do you have in Imo State?<\/p>\n\n\n\n<p>A:There are five at the moment namely, Federal University of Technology, Owerri, Federal Polytechnic, Nekede, Alvan IkokuFederal College of Education, Imo State University and here. We are also going to use the ICT Centres at the 27 Local Government Areas of the state and town halls of communities. Corporate bodies like ZinoxTecnologies have started partnering with us. The chairman of Zinox, Chief .Leo Stan Ekeh came here and saw what we are doing and made a cash donation to support this vision and promised to do more because he was impressed.<br>Very soon, any digital service needed anywhere in Africa will be rendered from Imo State as Africa&#8217;s digital hub and people will be earning dollars and pounds sterling with their skills.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Pioneer Commissioner for Digital Economy and e-Government, Dr. Chimezie Amadi revealed in this interview with National News blast that Imo State will soon become Africa&#8217;s digital hub thanks to plans being activated by the newly created ministry, the first in Nigeria Excerpts. Q: May we know you, Sir? A: I am Dr. Chimezie Amadi, the &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/soon-imo-will-be-africas-digital-hub-dr-chimezie-amadi\/\"> <span class=\"screen-reader-text\">Soon, Imo will be Africa&#8217;s Digital Hub &#8211; Dr Chimezie Amadi<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":45,"featured_media":3992,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[44,31],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/08\/GOPR3613-1-scaled.jpg?fit=2560%2C2159&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3985"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/45"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=3985"}],"version-history":[{"count":0,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/3985\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/3992"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=3985"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=3985"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=3985"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}