{"id":4005,"date":"2023-02-20T16:05:00","date_gmt":"2023-02-20T16:05:00","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=4005"},"modified":"2023-08-07T08:11:33","modified_gmt":"2023-08-07T08:11:33","slug":"future-assured-for-imo-youths","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/future-assured-for-imo-youths\/","title":{"rendered":"Future assured for Imo youths "},"content":{"rendered":"\n<p><\/p>\n\n\n\n<p>The Federal Government though the Federal Ministry of Communication and Digital Economy launched the National Digital Economy and Strategy Policy (NDEPS) 2020-2030 and encouraged all the federating states which Imo is part of, to streamline their operations and adopt the provisions of this policy to give a fillip to the Digital Nigeria Agenda.<\/p>\n\n\n\n<p>On the benefits of Imo State in this federal government&#8217;s 10-year digital economy policy, he stated that the very point the Ministry was created and his subsequent appointment to head it, he wasted no time in setting the ball rolling with the help of the governor.<\/p>\n\n\n\n<p>According to him, one thing he had at the back of his mind was the goal of making Imo the leading digital economy state in Nigeria. The other objective, he added, is to make Imo the digital skill hub of Africa. And to achieve this goal, he further explained that they developed what is called Imo Digital Economy Agenda (IDEA)2022 -2026. The Commissioner explained that the policy is hinged on six pillars.<\/p>\n\n\n\n<p>He said: &#8220;We have pillar one, which we call digital literacy and skills. Pillar two we call the solid infrastructure. Pillar three is soft infrastructure. Pillar four is focused on advocacy. Pillar five is Monetary and Evaluation while the sixth pillar is about Collaboration and Partnership.<\/p>\n\n\n\n<p>&#8220;That first pillar, digital literacy and skills, will focus on equipping Imo youths with the fourth industrial revolution digital skills that will make them become players and contributors in the evolving digital economy which this government has placed very high premium on.&#8221;<\/p>\n\n\n\n<p>Imo youths, he said, has benefitted from the programme since it started. &#8220;Imo youths have remained thankful for the enormous benefit they have derived. The first and the immediate impact it had on them is the idea of bringing into their consciousness the importance of technology in today&#8217;s world.<\/p>\n\n\n\n<p>&#8220;Before now, some of these youths were seen as graduates or holders of masters degree. They read different courses in the university but they are not employed and they are not employable because they do not have the digital skill required in a digital era. So, we brought their consciousness to become digitally literate and acquiring digital skills,&#8221; he explained.<\/p>\n\n\n\n<p>He added that a lot of them were already becoming self-employed on their own even midway into their training. Some of them, especially those doing courses like phone repairs, graphic design, digital marketing, are already having clients on their own.<\/p>\n\n\n\n<p>&#8220;There are businesses in Owerri that have no digital presence or footprint in the cyberspace which limits their volume of transaction per day. Part of the task we gave our trainees is to go out in the streets of Owerri, open social media business accounts for SMEs in platforms such as Instagram, Facebook, Yutube and begin to manage their online presence, create opportunity for people to see the products and services they offer and then patronise them,&#8221; he volunteered.<\/p>\n\n\n\n<p>Besides the free lunch and stipends given to the participants, they are also motivated through hackathons focused on what they have learnt and the best class receives N50,000 cash prize.<\/p>\n\n\n\n<p>Amadi also explained that they were receiving great assistance from technology gurus in the state such as Leo Stan Ekeh, the Zinox boss, and others.<\/p>\n\n\n\n<p>One of the participants, John Paul, who expressed his joy for being part of the programme thanked the governor for his initiative. He said: &#8221; It&#8217;s not easy to fund this kind of skills acquisition programme but the governor has done it. On our own part, after all the good gesture, we promise to replicate it to those outside.&#8221;<\/p>\n\n\n\n<p>Another participant, Olusegun Ójo, said the training afforded him the opportunity to be self employed, as many clients now book appointment with him to do one or two things for them.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Federal Government though the Federal Ministry of Communication and Digital Economy launched the National Digital Economy and Strategy Policy (NDEPS) 2020-2030 and encouraged all the federating states which Imo is part of, to streamline their operations and adopt the provisions of this policy to give a fillip to the Digital Nigeria Agenda. On the &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/future-assured-for-imo-youths\/\"> <span class=\"screen-reader-text\">Future assured for Imo youths <\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":3996,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[55,31],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/08\/hope4.jpg?fit=720%2C720&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4005"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=4005"}],"version-history":[{"count":0,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4005\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/3996"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=4005"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=4005"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=4005"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}