{"id":4534,"date":"2023-09-28T15:56:00","date_gmt":"2023-09-28T15:56:00","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=4534"},"modified":"2023-10-02T07:18:30","modified_gmt":"2023-10-02T07:18:30","slug":"uzodinma-graduates-15000-youths-from-skillupimo-cohort-2","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/uzodinma-graduates-15000-youths-from-skillupimo-cohort-2\/","title":{"rendered":"UZODINMA GRADUATES 15,000 YOUTHS FROM SKILLUPIMO COHORT 2."},"content":{"rendered":"\n<h2 class=\"wp-block-heading\"> <strong>MINISTRY OF DIGITAL ECONOMY AND E- GOVERNMENT<\/strong>.<\/h2>\n\n\n\n<p>Governor Hope Uzodimma of Imo State on Wednesday, September 27<sup>th<\/sup> 2023 graduated the 15,000 Cohort 2 Skillupimo students at the Dan Anyiam Stadium.<\/p>\n\n\n\n<p>&nbsp;The SkillupImo Project is the premier digital empowerment programme of H.E Dist. Senator Hope Uzodinma’s administration targeted at up-skilling, re-skilling and training 300,000 Imo youths to acquire the 4th Industrial Revolution (4IR) skill sets needed to align and fit into the evolving digital world. 5,000 Imolites had earlier graduated from the programme, thus bringing the total number of graduates to 20,000<\/p>\n\n\n\n<p>This initiative to infuse Imo youths with digital skills is in line with the Imo Digital Economy Agenda (IDEA) 2022 to 2026 with the aim of making Imo the digital skills hubs of Africa and curbing the menace of unemployment and insecurity. The Agenda is also in sync with the Federal Government’s National Digital Economy Policy &amp; Strategy (NDEPS), 2020-203<\/p>\n\n\n\n<p>“My dear future technology tycoons, the Skill-Up Imo project means the world to me, and I desire to see you succeed. To me, Skill-Up Imo is the investment of our administration in a future that has already arrived. I see an array of opportunities in the digital sphere that if exploited, will give Imo the competitive advantage among the comity of states affording us the enviable status of the technology hub of the country.<\/p>\n\n\n\n<p>“My dear young ones, in this world of technology, there is no room for laxity, arms folding, or aimless slumber. The world has virtually been reduced to a small village that sits on the palm of your hand. If ever the maxim ‘your destiny is in your hands’ were true, it is now. I urge you to get up and maximize this opportunity for destiny favours the diligent” said the Governor in his address.<\/p>\n\n\n\n<p>He added that Imo has continued to record high graduate employment through SkillupImo with tech-based companies such as Zinox Technologies Ltd, Konga Online Ltd, Wakanow.com etc, whilst calling on all the graduates to make the best use of the skills learnt towards transforming Imo State and, by extension, the entire country into a bedrock of technological advancement in Africa.<\/p>\n\n\n\n<p>“Let me also assure you all that we shall not relent in our efforts towards making the quality of the Programme a world-class standard by strengthening our collaborative partnerships with global tech giants like Microsoft, CISCO and Hauwei”, he stated.<\/p>\n\n\n\n<p>In furtherance of this, I am glad to inform you that we already have an understanding with some European and Canadian Companies. Through this understanding, Companies in these countries have agreed to send us a list of specific digital skills they require to service their production in their home countries and requested us to train our youths in these specified skills.<\/p>\n\n\n\n<p>He announced that the Cohort III batch of the Skill-Up Imo programme which will commence soon will train another set of Forty Thousand (40,000) youths in digital skills.<\/p>\n\n\n\n<p>At the event, the Chairman of Zinox Technologies Ltd, Mr. Leo- Stan Ekeh challenged the 15,000 youths who graduated from the Cohort 2 Skill-Up Imo project to take advantage of the training they have acquired to be what God says they should be.<\/p>\n\n\n\n<p>“I am not a politician. But I can tell you this is not politics. I come from here, from one remote community here in Imo State. If I was given an opportunity like this many years ago, I would have been one of the five richest men in the world. Nobody has done what Governor Hope Uzodimma is doing in Imo,” Mr. Ekeh whose Zinox Technologies Ltd dominates the market in Africa said.<\/p>\n\n\n\n<p>Mr. Ekeh also advised the families of the lucky graduates to commit Governor Uzodimma in their prayers so that God will continue to use him to improve on the lives of the people.<\/p>\n\n\n\n<p>The Minister of Communications, Innovation and Digital Economy, Dr. Bosun Tijani in his remarks congratulated Governor Uzodimma for taking such bold step to impact on the lives of the youths.<\/p>\n\n\n\n<p>Dr. Tijani said going by what he has seen, Imo State is emerging as the digital headquarters of Nigeria. He said that the Governor can conveniently be referred to as a professor in digital affairs.<\/p>\n\n\n\n<p>The Minister who admonished the graduates not to misuse the opportunity which has been given to them and promised that his ministry will partner with the Governor and government on all areas that concern the SkillupImo project<\/p>\n\n\n\n<p>Earlier in his welcome address, the Imo State Commissioner for Digital Economy and E- Government, Dr. Chimezie Amadi thanked Governor Uzodimma for his investment in the youths.<\/p>\n\n\n\n<p>He reminded the audience that in the history of Nigeria, no Governor or government has invested as much as Governor Uzodimma in one single swoop for a graduation programme like the one under review.<\/p>\n\n\n\n<p>’’ SkillupImo has not just successfully empowered youths with essential digital skills and tools enabling them to access greater job opportunities and improved their livelihood but we have also served as a model and inspiration for other States” stated Amadi. He added that the graduates will not forget Governor Uzodimma in a hurry.<\/p>\n\n\n\n<p>Some of the graduates who gave testimonies of their experiences regarding the programme on behalf of their colleagues, expressed how their lives had changed while appealing to the Governor to ensure the sustainability of the project.<\/p>\n\n\n\n<p>The graduates were handed over&nbsp; HP brand new laptop to enable them practice their skills<\/p>\n\n\n\n<p>The event was attended by many dignitaries including the wife of the Governor, Barr. Chioma Uzodimma, the Minister of Science and Technology, Chief Uche Nnaji, the Minister of States, Labour and Employment, Rt. Hon Nkiruka Onyejiocha, the Director General of South East Governors Forum, Sen. Uche Ekwunife, the Speaker of Imo State House of Assembly, Rt Hon. Chike Olemgbe, the Chief Judge of Imo State, Justice Theresa Chikeka, Former I.N.E.C chairman, Dr. Maurice Iwu among others<\/p>\n","protected":false},"excerpt":{"rendered":"<p> MINISTRY OF DIGITAL ECONOMY AND E- GOVERNMENT. Governor Hope Uzodimma of Imo State on Wednesday, September 27th 2023 graduated the 15,000 Cohort 2 Skillupimo students at the Dan Anyiam Stadium. &nbsp;The SkillupImo Project is the premier digital empowerment programme of H.E Dist. Senator Hope Uzodinma’s administration targeted at up-skilling, re-skilling and training 300,000 Imo youths &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/uzodinma-graduates-15000-youths-from-skillupimo-cohort-2\/\"> <span class=\"screen-reader-text\">UZODINMA GRADUATES 15,000 YOUTHS FROM SKILLUPIMO COHORT 2.<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[55],"tags":[],"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4534"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=4534"}],"version-history":[{"count":1,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4534\/revisions"}],"predecessor-version":[{"id":4539,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4534\/revisions\/4539"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=4534"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=4534"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=4534"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}