{"id":4535,"date":"2023-10-02T07:18:17","date_gmt":"2023-10-02T07:18:17","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=4535"},"modified":"2023-10-17T12:33:36","modified_gmt":"2023-10-17T12:33:36","slug":"4535-2","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/4535-2\/","title":{"rendered":"Governor Hope Uzodimma Is Right, labour export is a pillar of development"},"content":{"rendered":"\n<p>By: <a href=\"https:\/\/redlionmedia.home.blog\/export-job-opportunities-governor-hope-uzodimma-is-right-labour-export-is-a-pillar-of-development\/\" target=\"_blank\" rel=\"noreferrer noopener\">Prince Eze Ugochukwu<\/a><\/p>\n\n\n\n<p>As usual, there has been some noise from the un-informed about the statement by the Imo State Governor to export graduates of his digital skills training program abroad.<\/p>\n\n\n\n<p>Unfortunately, most of the commentators are ignorant of the upsides of that intention and plan by Governor Hope Uzodimma.<\/p>\n\n\n\n<p>Skills export is nothing new. The policy of Governor Hope Uzodimma is to train 300,000 Imo youths in digital skills by year 2026. So far, 20,000 of such youths has been trained with another 40,000 about to begin their training.<\/p>\n\n\n\n<p>People can make use of their skills in another country thereby acquiring valuable work experience and then return home in CIRCULAR MIGRATION. For Imo State, this will be a win-win situation. It will benefit the worker making use of it’s mobility, and it will benefit the home state as upon return, the worker has improved skills and valuable experience from work abroad. One aspect of this CIRCULAR MIGRATION pattern is also remittances, where persons working abroad sends money back to his home state when working abroad.<\/p>\n\n\n\n<p>So when Governor Uzodimma talks about strategically sponsoring skilled persons to work abroad, he is invariably talking about another way to boost foreign remittances to Imo State, and also create job opportunities for those willing to work abroad.<\/p>\n\n\n\n<p>Again some commentators have talked about the number of persons. (4,000 persons). The fact is that many people cannot see the big picture and that is so sad. Be that as it may, there is nothing wrong in having big plans, after all as the saying goes, “who dares wins”. therefore, anyone who has the courage to do something receives benefit. You might even go so far as to say that courage is its own reward. Daring to try something new or difficult&nbsp;can be intimidating.<br>It takes courage to push through the uncertainty and difficulties, but daring to try is the only path to triumph.<\/p>\n\n\n\n<p>Now, even if Governor Uzodimma did not deliver on the actual numbers and did not meet the deadline, it does not defeat the objective of exposing digitally skilled Imo youths to good job opportunities abroad. In today’s virtual world of zooms and teleconferencing, some can stay back in Imo and deliver jobs abroad and still earn income in foreign currency.<\/p>\n\n\n\n<p>Come to think of it, companies within the European Union are estimated to be around 23.2 million. There is a European Union work visa that permits a non-EU national to work in an EU country. The Work Visa is usually valid for one year but can be extended and to be eligible for an EU work visa, you must have a job offer from a company based in an EU member state. So where have Uzodimma gone wrong if he tries to tap into this.<\/p>\n\n\n\n<p>But let us take a look at the Philippine and India and South Korea.<\/p>\n\n\n\n<p>The Philippine is the top one country of labour exporting. About 10% of national population working overseas earn more than $12.8 billion U.S. dollars yearly which support and promote the development of the domestic economy effectively. This shows that labour export is a pillar of development.<\/p>\n\n\n\n<p>India is another country that exports skilled citizens on the lines of manpower -support pacts with other countries. Workers will go to these countries not as permanent immigrants but as employees in sectors where there is high demand of such skills.<\/p>\n\n\n\n<p>Take a look at&nbsp; South Korea one of the Asian Tigers, by sending workers abroad,the Korea Overseas Development Corporation, brought in Foreign Exchange Remittances and Needed Advanced Technologies, Key for Economic Development,which laid the Foundation for the Korean Government to articulately draw up and implement it’s long Term National Economic Development Plan.<\/p>\n\n\n\n<p>Politicians Think of the Next Election. Statesmen like the Distinguished Senator Hope Uzodimma, think of the GENERATION NEXT.<\/p>\n\n\n\n<p>Therefore, Governor Uzodimma linking the Imo State skilled labour market with those of other countries provides an immense opportunity.<\/p>\n\n\n\n<p>Governor Hope Uzodimma thinks big whether we like it or not, but thats the truth. Who can visualize the linking of Owerri to Orlu, to Okigwe and to Umuahia with solid roads? Within four years, three new state of the art general hospitals were built and commissioned. A new international conference centre ongoing, The opening up and dredging of the Orashi River into the Atlantic Ocean, which geographical surveys has been completed and approvals secured from the Federal government. Today the poor and vulnerable persons, including workers are getting free medical treatment under the basic healthcare program. This same Uzodimma has secured approval for an oil and gas free trade zone for Imo State. Secured funding from the African Development Bank for a Special Agro-Industrial Processing zone for Imo State. He is currently installing night landing facilities at the Sam Mbakwe International Cargo Airport.<\/p>\n\n\n\n<p>Let’s take a look at another country. Canada is one of the most sought-after destinations amongst skilled workers. Here there is a huge demand in different provinces for skilled workers from abroad especially in information technology. This is a market that can be tapped into.<\/p>\n\n\n\n<p>Let us rather support the Governor and contribute in any little ways we can. Vilifications make no sense whatsoever.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>By: Prince Eze Ugochukwu As usual, there has been some noise from the un-informed about the statement by the Imo State Governor to export graduates of his digital skills training program abroad. Unfortunately, most of the commentators are ignorant of the upsides of that intention and plan by Governor Hope Uzodimma. Skills export is nothing &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/4535-2\/\"> <span class=\"screen-reader-text\">Governor Hope Uzodimma Is Right, labour export is a pillar of development<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":3996,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[31],"tags":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/08\/hope4.jpg?fit=720%2C720&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4535"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=4535"}],"version-history":[{"count":2,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4535\/revisions"}],"predecessor-version":[{"id":4557,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4535\/revisions\/4557"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/3996"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=4535"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=4535"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=4535"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}