{"id":4576,"date":"2023-11-15T07:08:21","date_gmt":"2023-11-15T07:08:21","guid":{"rendered":"https:\/\/mdeeg.im.gov.ng\/?p=4576"},"modified":"2023-11-15T07:08:29","modified_gmt":"2023-11-15T07:08:29","slug":"uzodinmas-digital-coronets","status":"publish","type":"post","link":"https:\/\/mdeeg.im.gov.ng\/uzodinmas-digital-coronets\/","title":{"rendered":"UZODINMA&#8217;S DIGITAL CORONETS"},"content":{"rendered":"\n<p>Last month, Imo took an enviable throttlehold on the nation&#8217;s digital and e-government space. It fantastically won the best state award on Information Communication Technology human capacity development instituted by the Presidency through its Bureau of Public Service Reforms.<\/p>\n\n\n\n<p>Besides, the State Commissioner in charge of the Ministry of Digital Economy and e-Government, Dr Chimezie Amadi was also honoured with Distinguished Govtech Trailblazers Award for his pioneering role in developing human capital in the digital economy<\/p>\n\n\n\n<p>The two awards, the first of their kind, having just made their debut were essentially initiated to motivate state goverments, other public institutions and public servants to advance the reform and remake of the public service for enhanced service delivery through digital transformation. The far-reaching and distinctive success recorded by SkillupImo, Governor Hope Uzodinma&#8217;s pet project attracted the awards.<\/p>\n\n\n\n<p>Apart from the two awards bagged last month in Abuja, the SkillupImo project has over the months eminently shown to be a signature award spinner. Only in July this year both Governor Uzodinma and Dr Amadi were adored in Lagos with awards on account of the huge success that has trailed the high-tech pet scheme<\/p>\n\n\n\n<p>Many believe that these awards are revolutionary in many ways. One, they have manifestly redrafted Imo into the national hall of fame as one of the key successful states in the country especially in the area of globalized digital sector. Two, the awards have in no small way put the administration of Senator Hope Uzodinma on a profoundly positive national burner thereby reinforcing the government&#8217;s success story. Three, the awards have potentially and largely brightened the Imo narratives, government reputation and public perception<\/p>\n\n\n\n<p>Dr Amadi, Imo Commissioner for Digital Economy and e-Government who is on the driver&#8217;s seat of the scheme corroborates: &#8220;These remarkable achievements are testaments to the unwavering dedication, innovations and passion that flow through the veins of our great state. Imo is shinning bright on the national stage and it&#8217;s an incredible moment of pride for all of us&#8221;.<\/p>\n\n\n\n<p>Dr. Amadi is right. These awards are vivid manifestations of the achievements of Governor Uzodinma in the state. They not only boost the government&#8217;s positive image but essentially reinforce its pride at the national front<\/p>\n\n\n\n<p>However, SkillupImo which provided the basis for the awards is one of Governor Uzodinma&#8217;s major strides to domesticate digital economy in Imo in order to develop human capital options. The framework according to the Commissioner is to create digital enterpreneurs and impresarios desired to scale down unemployment rate and improve the state economy.<\/p>\n\n\n\n<p>In concept, strategic plan, content and management shrewdness, the scheme is evidently well-resourced and results oriented. This perhaps accounts for the chain of attainments, awards and honours the scheme has inherently attracted to the state. Describing the scheme as pillar of strength, Governor Uzodinma&#8217;s vision is to use the scheme to transform the state digitally by harnessing the power of technology to drive the economy, service, progress and development<\/p>\n\n\n\n<p>In Quantifiable and concrete terms, the mission of Governor Uzodinma noted Dr Amadi is to use the scheme to &#8220;upskill, reskill and train 300,000 Imo youths to acquire the 4th Industrial Revolution expertise needed to fit into the evolving digital world&#8221;. The intrinsic goal apparently is to make Imo youths and indeed Imolites the centre-point of digitalization towards stimulating all-inclusive and proactive approach in the use of technology in the state.<\/p>\n\n\n\n<p>Experts believe that this innovative approach will not only make Imo the technology hub of the nation but provoke wealth creation desirable for Imo economic growth<\/p>\n\n\n\n<p>The Indian and Silicon Valley in Northern California, US experiences are germane here. Both are the known centres of digitalization and innovation in the world. They achieved it through well-planned high-tech and innovation roadmap as Governor Uzodinma has currently set out in the state.<\/p>\n\n\n\n<p>India, for instance commenced its digital program in 2015. Akin to Imo India focused on transforming the country into a digitally empowered society and a knowledge-based economy. Today, it&#8217;s a huge success story<\/p>\n\n\n\n<p>Silicon Valley however has a longer history than India. But then government&#8217;s vision, roadmap and positive regulations as being witnessed at present in Imo made Silicon Valley world&#8217;s largest high-tech destination. It&#8217;s reputed to have the leading start-up ecosystem in digital ventures and innovations globally and employed about a million information technology workers<\/p>\n\n\n\n<p>With proper planning, robust navigation and functional execution the Indian and Silicon Valley examples can ultimately be replicated in Imo. Interestingly, the Commissioner noted that the digital scheme would be undertaken in phases for efficiency and enhanced results. No fewer than 20,000 Imo youths according to him have so far passed through the programme designed to empower the participants and Imolites digitally for greater wealth creation and improved livelihoods<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last month, Imo took an enviable throttlehold on the nation&#8217;s digital and e-government space. It fantastically won the best state award on Information Communication Technology human capacity development instituted by the Presidency through its Bureau of Public Service Reforms. Besides, the State Commissioner in charge of the Ministry of Digital Economy and e-Government, Dr Chimezie &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/mdeeg.im.gov.ng\/uzodinmas-digital-coronets\/\"> <span class=\"screen-reader-text\">UZODINMA&#8217;S DIGITAL CORONETS<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":4577,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_eb_attr":"","site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","footnotes":""},"categories":[44,52,55],"tags":[59,51],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/mdeeg.im.gov.ng\/wp-content\/uploads\/2023\/11\/Senator-Hope-Uzodinma-and-Dr-Chimezie-Anadi.jpg?fit=592%2C410&ssl=1","_links":{"self":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4576"}],"collection":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/comments?post=4576"}],"version-history":[{"count":1,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4576\/revisions"}],"predecessor-version":[{"id":4578,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/posts\/4576\/revisions\/4578"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media\/4577"}],"wp:attachment":[{"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/media?parent=4576"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/categories?post=4576"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mdeeg.im.gov.ng\/wp-json\/wp\/v2\/tags?post=4576"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}